app/views/pages/profilepage.html.erb

					<div class="col-xs-4" >
						<a type="button" class="btn followers" href="#following_modal" data-toggle="modal">following</br><p><%= Follower.count(:conditions => "user_id_follower = #{$current_user.id}") %></p></a>
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id_follower" = 1
SELECT COUNT(*) FROM "followers" WHERE (user_id_follower = 1)

                                  <% find_following.each do |fol| %>
                                      <% user = User.find_by_id(fol) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

					<div class="col-xs-4">
						<a type="button" class="btn followers" href="#followers_modal" data-toggle="modal">followers</br><p><%= Follower.count(:conditions => "user_id_model = #{$current_user.id}") %></p></a>
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id_model" = 1

                <% find_lists.each do |list| %>
                    <p><a href='/my_lists/<%=MyList.find_by_list_name_and_owner_id(list.list_name, $current_user.id).id%>'><%= list.list_name %></a></p>
---
SELECT "my_lists".* FROM "my_lists" WHERE "my_lists"."list_name" = 'Worst Movies Ever' AND "my_lists"."owner_id" = 2 LIMIT 1