app/views/pages/profile.html.erb

SELECT "followers".* FROM "followers" WHERE "followers"."user_id_follower" = 1
SELECT COUNT(*) FROM "followers" WHERE (user_id_follower = 1)
---
			<div class="col-xs-4" >
				<a type="button" class="btn followers" href="#following_modal" data-toggle="modal">following</br><p><%= Follower.count(:conditions => "user_id_follower = #{$current_visited_user.id}") %></p></a>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
                            <% find_visited_following.each do |fol| %>
                                <% user = User.find_by_id(fol) %>

SELECT "followers".* FROM "followers" WHERE "followers"."user_id_model" = 1
---
			<div class="col-xs-4">
				<a type="button" class="btn followers" href="#followers_modal" data-toggle="modal">followers</br><p><%= Follower.count(:conditions => "user_id_model = #{$current_visited_user.id}") %></p></a>