app/controllers/my_lists_controller.rb

  def create
    @my_list = MyList.new(params[:my_list])

    respond_to do |format|
      if @my_list.save
---
INSERT INTO "my_lists" ("created_at", "list_name", "owner_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 03:24:22 UTC +00:00], ["list_name", "Worst Movies Ever"], ["owner_id", nil], ["updated_at", Wed, 13 Nov 2013 03:24:22 UTC +00:00]]