app/controllers/pages_controller.rb

  def search
    query = params[:query]         #the input string that the user wrote in the search field
    $users = []
    $lists = []
    $q = query
    counter = 0
    $lol = params[:type]           #the radio button value the use set (movies, users, lists)
    if params[:type] == "users"    #if the user checked the 'Users' radio button
      #usrs = User.all              #find all users
      user = User.find_by_username(query);
      #if query.length != 0         #check that the input string is not empty
       # usrs.each do |user|
        #  usrnm = user.username.downcase    #for every user, find the user name
         # if usrnm.include? query.downcase
          #  counter += 1
          if (user)
            $users.push(user)      #then add the user to the list that is presented as search results
          end
            #else

            #end
          #if counter == 10
            #break
            #end
          #end
      #end
        $type = "users"
        redirect_to '/pages/list'
    elsif params[:type] == "lists"
      listz = MyList.all              #find all users
---
SELECT "my_lists".* FROM "my_lists"

  def find_followers
    #find all followers of a user with id $current_user.id
    followers = Rails.cache.fetch(:followers) do
      Follower.find_all_by_user_id_model($current_user.id)
    end
    followers_user_ids = []
    followers.each do |follower|
      user_id = User.find(follower.user_id_follower).id
      followers_user_ids.push(user_id)
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id_model" = 1
SELECT "followers".* FROM "followers" WHERE "followers"."user_id_follower" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
INSERT INTO "followers" ("created_at", "updated_at", "user_id_follower", "user_id_model") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 03:35:03 UTC +00:00], ["updated_at", Wed, 13 Nov 2013 03:35:03 UTC +00:00], ["user_id_follower", 2], ["user_id_model", 1]]
UPDATE "users" SET "description" = 'Hey, my name is Kris and I love thriller movies', "updated_at" = '2013-11-13 03:24:08.143590' WHERE "users"."id" = 2

  def find_visited_followers
    #find all followers of a user with id $current_user.id
    followers = Follower.find_all_by_user_id_model($current_visited_user.id)
    followers_user_ids = []
    followers.each do |follower|
---
SELECT "users".* FROM "users"

  def find_lists
    Rails.cache.fetch(:mylists) do
      MyList.find_all_by_owner_id($current_user.id)
---
SELECT "my_lists".* FROM "my_lists" WHERE "my_lists"."owner_id" = 1

  def addmovie
    $m_id = params[:movieid]
    type = params[:type]
    if (type == "regular")
      $l_id = params[:list]
      ListMovie.create(:list_id => params[:list], :movie_name => params[:movieid])
      Activity.create(:userid => $current_user.id, :username => $current_user.username, :movieid => params[:movieid], :moviename => params[:moviename], :listid => params[:list], :listname => params[:listname])
    elsif (type == "wishlist")
      UnseenMovie.create(:owner_id => $current_user.id, :movie_name => params[:movieid] )
    elsif (type == "seen")
      user_watched = WatchedMovie.find_by_user_id($current_user.id)
      if (user_watched.movies == "")
        movie_string = params[:movieid]
      else
        movie_string = user_watched.movies + ";" + params[:movieid]
      end
      user_watched.movies = movie_string
      user_watched.save
---
INSERT INTO "list_movies" ("created_at", "list_id", "movie_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 03:24:44 UTC +00:00], ["list_id", 1], ["movie_name", "tt0425186"], ["updated_at", Wed, 13 Nov 2013 03:24:44 UTC +00:00]]
INSERT INTO "activities" ("created_at", "listid", "listname", "movieid", "moviename", "updated_at", "userid", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "watched_movies".* FROM "watched_movies" WHERE "watched_movies"."user_id" = 1 LIMIT 1
UPDATE "watched_movies" SET "movies" = ';tt0120737', "updated_at" = '2013-11-13 00:42:53.654854' WHERE "watched_movies"."id" = 1

  def updateprofile                 #this function is called when a user clicks a list he has created in profilepage
    type = params[:type]
    $listmovies = []
    if (type == "regular")
      $list_id = params[:list]        #the list_id is sent as a parameter
      list_of_movies = ListMovie.find_all_by_list_id($list_id)    #cant cache because you can switch between different lists
---
SELECT "list_movies".* FROM "list_movies" WHERE "list_movies"."list_id" = 1

  def gotoprofile_or_addfollower
    user = params[:user_id]
    type = params[:type]
    $current_visited_user = User.find_by_id(user)
    if type == "gotoprofile"
      if ($current_user.id == $current_visited_user.id)
        redirect_to '/pages/profilepage'
      else
        redirect_to '/pages/profile'
      end
    elsif type == "addfollower"
        Follower.create(:user_id_model => $current_visited_user.id, :user_id_follower => $current_user.id)
        redirect_to '/pages/profile'
    elsif type == "list"
        $listmovies = []
        list_of_movies = ListMovie.find_all_by_list_id(params[:list])
---
SELECT "list_movies".* FROM "list_movies" WHERE "list_movies"."list_id" IS NULL