app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
        @user.following_no='0'
        @user.followers_no='0'
        @user.save
        WatchedMovie.create(:user_id => @user.id, :movies => "")
---
INSERT INTO "users" ("created_at", "description", "email", "firstname", "lastname", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "watched_movies" ("created_at", "movies", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 00:42:29 UTC +00:00], ["movies", ""], ["updated_at", Wed, 13 Nov 2013 00:42:29 UTC +00:00], ["user_id", 1]]